ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h


#define _HW_REG_(hw_reg_address) (*(unsigned char*)( 0x5000 +hw_reg_address ) )



//--------------------------------------------------------I/O PORT HARDWARE REGISTER MAP------------------------------------------------------------------//

#if defined(using_io_ports)

//	Port A.

//#if defined(using_port_a)

#define PA_ODR	*(unsigned char*) 0x5000 		//	Port A data output latch register.
#define PA_IDR	*(unsigned char*) 0x5001		//	Port A input pin value register.
#define PA_DDR	*(unsigned char*) 0x5002		//	Port A data direction register
#define PA_CR1	*(unsigned char*) 0x5003		//	Port A control register 1
#define PA_CR2	*(unsigned char*) 0x5004		//	Port A control register 2

//#endif

//__________________________________________________________________________________________________________________________________________________________

//	Port B.

//#if defined(using_port_b)

#define PB_ODR	*(unsigned char*) 0x5005		//	Port B data otuput latch register.
#define PB_IDR	*(unsigned char*) 0x5006		//	Port B input value register.
#define PB_DDR	*(unsigned char*) 0x5007		//	Port B data direction register.
#define PB_CR1	*(unsigned char*) 0x5008		//	Port B control register 1.
#define PB_CR2	*(unsigned char*) 0x5009		//	Port B control register 2.

//#endif

//__________________________________________________________________________________________________________________________________________________________

//	Port C.

//#if defined(using_port_c)

#define PC_ODR	*(unsigned char*) 0x500A		//	Port C data otuput latch register.
#define PC_IDR	*(unsigned char*) 0x500B		//	Port C input value register.
#define PC_DDR	*(unsigned char*) 0x500C		//	Port C data direction register.
#define PC_CR1	*(unsigned char*) 0x500D		//	Port C control register 1.
#define PC_CR2	*(unsigned char*) 0x500E		//	Port C control register 2.

//#endif

//__________________________________________________________________________________________________________________________________________________________

//	Port D.

//#if defined(using_port_d)

#define PD_ODR	*(unsigned char*) 0x500F		//	Port D data otuput latch register.
#define PD_IDR	*(unsigned char*) 0x5010		//	Port D input value register.
#define PD_DDR	*(unsigned char*) 0x5011		//	Port D data direction register.
#define PD_CR1	*(unsigned char*) 0x5012		//	Port D control register 1.
#define PD_CR2	*(unsigned char*) 0x5013		//	Port D control register 2.

//#endif

//__________________________________________________________________________________________________________________________________________________________

//	Port E.

//#if defined(using_port_e)

#define PE_ODR	*(unsigned char*) 0x5014		//	Port E data otuput latch register.
#define PE_IDR	*(unsigned char*) 0x5015		//	Port E input value register.
#define PE_DDR	*(unsigned char*) 0x5016		//	Port E data direction register.
#define PE_CR1	*(unsigned char*) 0x5017		//	Port E control register 1.
#define PE_CR2	*(unsigned char*) 0x5018		//	Port E control register 2.

//#endif

//__________________________________________________________________________________________________________________________________________________________

//	Port F.

//#if defined(using_port_f)

#define PF_ODR	*(unsigned char*) 0x5019		//	Port F data otuput latch register.
#define PF_IDR	*(unsigned char*) 0x501A		//	Port F input value register.
#define PF_DDR	*(unsigned char*) 0x501B		//	Port F data direction register.
#define PF_CR1	*(unsigned char*) 0x501C		//	Port F control register 1.
#define PF_CR2	*(unsigned char*) 0x501D		//	Port F control register 2.

//#endif


//-------------------------------------------------------I/O PORT HARDWARE REGISTER BITS-----------------------------------------------------------------//

//#if defined(using_io_ports)

//	Output data latch register bits.

#define ODR7	7
#define ODR6	6
#define ODR5	5
#define ODR4	4
#define ODR3	3
#define ODR2	2
#define ODR1	1
#define ODR0	0

//__________________________________________________________________________________________________________________________________________________________

//	Input data value register bits.

#define IDR7	7
#define IDR6	6
#define IDR5	5
#define IDR4	4
#define IDR3	3
#define IDR2	2
#define IDR1	1
#define IDR0	0

//__________________________________________________________________________________________________________________________________________________________

//	Data direction latch register bits.

#define DDR7	7
#define DDR6	6
#define DDR5	5
#define DDR4	4
#define DDR3	3
#define DDR2	2
#define DDR1	1
#define DDR0	0

//__________________________________________________________________________________________________________________________________________________________

//	Port configuration register 1 bits.

#define C17	7
#define C16	6
#define C15	5
#define C14	4
#define C13	3
#define C12	2
#define C11	1
#define C10	0

//__________________________________________________________________________________________________________________________________________________________

//	Port configuration register 2 bits.

#define C27	7
#define C26	6
#define C25	5
#define C24	4
#define C23	3
#define C22	2
#define C21	1
#define C20	0

#endif

//__________________________________________________________________________________________________________________________________________________________

 







//-------------------------------------------GENERAL HARDWARE REGISTER & BIT DEFINITIONS----------------------------------------------------------------//

//	Block Name : Flash.

#if defined(using_flash)

#define FLASH_CR1	*(unsigned char*) 0x505A		//	Flash control register 1.
#define FLASH_CR2	*(unsigned char*) 0x505B		//	Flash control register 2.
#define FLASH_NCR2	*(unsigned char*) 0x505C		//	Flash complementary control register 2.
#define FLASH_FPR	*(unsigned char*) 0x505D		//	Flash protection register.
#define FLASH_NFPR	*(unsigned char*) 0x505E		//	Flash completentary protection register.
#define FLASH_IAPSR	*(unsigned char*) 0x505F		//	Flash in-application programming status register.
#define FLASH_PUKR	*(unsigned char*) 0x5062		//	Flash program memory unprotection register.
#define FLASH_DUKR	*(unsigned char*) 0x5063		//	Data EEPROM unprotection register.

