ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
//	Register : FLASH_CR1

#define FLASH_CR1_HALT 	3		//	Power-Down in halt mode.
#define FLASH_CR1_AHALT 	2		//	Power-Down in active halt mode.
#define FLASH_CR1_IE	1		//	Flash Interrupt Enable.
#define FLASH_CR1_FIX	0		//	Fixed Byte programming time.

//	Register : FLASH_CR2

#define FLASH_CR2_OPT	7		//	Write option bytes.
#define FLASH_CR2_WPRG	6		//	Word Programming.
#define FLASH_CR2_ERASE	5		//	Block erase.
#define FLASH_CR2_FPRG	4		//	Fast block programming.
#define FLASH_CR2_PRG	0		//	Standard programming.

//	Register : FLASH_NCR2

#define FLASH_NCR2_NOPT	7		//	Write option bytes.
#define FLASH_NCR2_NWPRG	6		//	Word Programming.
#define FLASH_NCR2_NERASE	5		//	Block erase.
#define FLASH_NCR2_NFPRG	4		//	Fast block programming.
#define FLASH_NCR2_NPRG	0		//	Standard programming.

//	Register : FLASH_FPR

#define FLASH_FPR_WPB5	5		//	User boot code area protection bit 5.
#define FLASH_FPR_WPB4	4		//	User boot code area protection bit 4.
#define FLASH_FPR_WPB3	3		//	User boot code area protection bit 3.
#define FLASH_FPR_WPB2	2		//	User boot code area protection bit 2.
#define FLASH_FPR_WPB1	1		//	User boot code area protection bit 1.
#define FLASH_FPR_WPB0	0		//	User boot code area protection bit 0.

//	Register : FLASH_NFPR

#define FLASH_NFPR_NWPB5	5		//	User boot code area protection bit 5.
#define FLASH_NFPR_NWPB4	4		//	User boot code area protection bit 4.
#define FLASH_NFPR_NWPB3	3		//	User boot code area protection bit 3.
#define FLASH_NFPR_NWPB2	2		//	User boot code area protection bit 2.
#define FLASH_NFPR_NWPB1	1		//	User boot code area protection bit 1.
#define FLASH_NFPR_NWPB0	0		//	User boot code area protection bit 0.

//	Register : FLASH_IAPSR.

#define FLASH_IAPSR_HVOFF		6	//	End of high voltage flag.
#define FLASH_IAPSR_DUL		3	//	Data EEPROM area unlocked flag.
#define FLASH_IAPSR_EOP		2	//	End of programming flag.
#define FLASH_IAPSR_PUL		1	//	Flash program memory unlocked flag.
#define FLASH_IAPSR_WR_PG_DIS	0	//	Write attempted to protected page flag.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : ITC

#if defined(using_itc)

#define EXTI_CR1 *(unsigned char*)	0x50A0		//	External interrupt control register 1.
#define EXTI_CR2 *(unsigned char*)	0x50A1		//	External interrupt control register 2.

//	Register name : EXTI_CR1

#define EXTI_CR1_PDIS1	7	//	Port D external interrupt sensitivity bit 1.
#define EXTI_CR1_PDIS0	6	//	Port D external interrupt sensitivity bit 0.
#define EXTI_CR1_PCIS1	5	//	Port C external interrupt sensitivity bit 1.
#define EXTI_CR1_PCIS0	4	//	Port C external interrupt sensitivity bit 0.
#define EXTI_CR1_PBIS1	3	//	Port B external interrupt sensitivity bit 1.
#define EXTI_CR1_PBIS0	2	//	Port B external interrupt sensitivity bit 0.
#define EXTI_CR1_PAIS1	1	//	Port A external interrupt sensitivity bit 1.
#define EXTI_CR1_PAIS0	0	//	Port A external interrupt sensitivity bit 0.

//	Register name : EXTI_CR2.

#define EXTI_CR2_TLIS	2	//	Top level interrupt sensitivity.
#define EXTI_CR2_PEIS1	1	//	Port E interrupt sensitivity bit 1.
#define EXTI_CR2_PEIS0	0	//	Port E interrupt sensitivity bit 0.	

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : RST.

#if defined(using_rst)

#define RST_SR *(unsigned char*)	0x50B3	//	Reset status register.

//	Register name : RST_SR.

#define RST_SR_EMCF	4	//	EMC reset flag.
#define RST_SR_SWIMF	3	//	SWIM reset flag.
#define RST_SR_ILLOPF	2	//	Illegal op-code reset flag.
#define RST_SR_IWDGF	1	//	Independent watchdog reset flag.
#define RST_SR_WWDGF	0	//	Window watchdog reset flag.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : CLK.

#if defined(using_clk)

#define CLK_ICKR	*(unsigned char*) 0x50C0		//	Internal clock control register.
#define CLK_ECKR	*(unsigned char*) 0x50C1		//	External clocl control register.
#define CLK_CMSR	*(unsigned char*) 0x50C3		//	Clock master status register.
#define CLK_SWR		*(unsigned char*) 0x50C4		//	Clock master switch register.
#define CLK_SWCR	*(unsigned char*) 0x50C5		//	Clock master switch control register.
#define CLK_CKDIVR	*(unsigned char*) 0x50C6		//	Clock divider register.
#define CLK_PCKENR1	*(unsigned char*) 0x50C7		//	Peripheral clock gating register 1.
#define CLK_CSSR	*(unsigned char*) 0x50C8		//	Clock security system register.
#define CLK_CCOR	*(unsigned char*) 0x50C9		//	Configurable clock control register.
#define CLK_PCKENR2	*(unsigned char*) 0x50CA		//	Peripheral clock gating register 2.
#define CLK_CANCCR	*(unsigned char*) 0x50CB		//	CAN clock control register.
#define CLK_HSITRIMR	*(unsigned char*) 0x50CC		//	HSI clock calibration trimming register.
#define CLK_SWIMCCR	*(unsigned char*) 0x50CD		//	SWIM clock control register.

//	Register name : CLK_ICKR.

#define CLK_ICKR_REGAH	5		//	Regulator power off in active halt mode.
#define CLK_ICKR_LSIRDY	4		//	Low speed internal oscillator ready.
#define CLK_ICKR_LSIEN	3		//	Low speed internal RC oscillator enable.
#define CLK_ICKR_FHWU	2		//	Fast wakeup from halt/active-halt modes.
#define CLK_ICKR_HSIRDY	1		//	High speed internal oscillator ready.
#define CLK_ICKR_HSIEN	0		//	High speed internal RC oscillator enable.
	
//	Register name : CLK_ECKR.

#define CLK_ECKR_HSERDY	1		//	High speed external crystal oscillator ready.
#define CLK_ECKR_HSEEN	0		//	High speed external crystal oscillator enable.

//	Register name : CLK_SWCR.

#define CLK_SWCR_SWIF	3		//	Clock switch interrupt flag.
#define CLK_SWCR_SWIEN	2		//	Clock switch interrupt enable.
#define CLK_SWCR_SWEN	1		//	Switch start or stop.
#define CLK_SWCR_SWBSY	0		//	Switch busy.

//	Register name : CLK_CKDIVR.

#define CLK_CKDIVR_HSIDIV1		4	//	High speed internal clock prescalar bit 1.
#define CLK_CKDIVR_HSIDIV0		3	//	High speed internal clock prescalar bit 0.
#define CLK_CKDIVR_CPUDIV2		2	//	CPU clock prescalar bit 2.
#define CLK_CKDIVR_CPUDIV1		1	//	CPU clock prescalar bit 1.
#define CLK_CKDIVR_CPUDIV0		0	//	CPU clock prescalar bit 0.

