ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
//	Register name : CLK_CSSR.

#define CLK_CSSR_CSSD		3	//	Clock security system detection.
#define CLK_CSSR_CSSDIE		2	//	Clock security system detection interrupt enable.
#define CLK_CSSR_AUX		1	//	Auxillary clock connected to master clock.
#define CLK_CSSR_CSSEN		0	//	Clock security system enable.

//	Register name : CLK_CCOR.

#define CLK_CCOR_CCOBSY		6	//	Configurable clock output busy.
#define CLK_CCOR_CCORDY		5	//	Configurable clock output ready.
#define CLK_CCOR_CCOSEL3		4	//	Configurable clock output selection bit 3.
#define CLK_CCOR_CCOSEL2		3	//	Configurable clock output selection bit 2.
#define CLK_CCOR_CCOSEL1		2	//	Configurable clock output selection bit 1.
#define CLK_CCOR_CCOSEL0		1	//	Configurable clock output selection bit 0.
#define CLK_CCOR_CCOEN		0	//	Configurable clock output enable.

//	Register name : CLK_HSITRIMR.

#define CLK_HSITRIMR_HSITRIM3	3	//	HSI trimming value bit 3.
#define CLK_HSITRIMR_HSITRIM2	2	//	HSI trimming value bit 2.
#define CLK_HSITRIMR_HSITRIM1	1	//	HSI trimming value bit 1.
#define CLK_HSITRIMR_HSITRIM0	0	//	HSI trimming value bit 0.

//	Register name : CLK_SWIMCCR.

#define CLK_SWIMCCR_SWIMCLK		0	//	SWIM clock driver.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : WWDG ( Window watchdog timer ).

#if defined(using_wwdg)

#define WWDG_CR		*(unsigned char*) 0x50D1		//	WWDG control register.
#define WWDG_WR		*(unsigned char*) 0x50D2		//	WWDG window register.


//	Register name : WWDG_CR.

#define	WWDG_CR_WDGA	7		//	Activation bit.
#define WWDG_CR_T6	6		//	7-bit counter ( bit 6 ). 	
#define WWDG_CR_T5	5		//	7-bit counter ( bit 5 ).
#define WWDG_CR_T4	4		//	7-bit counter ( bit 4 ).
#define WWDG_CR_T3	3		//	7-bit counter ( bit 3 ).
#define WWDG_CR_T2	2		//	7-bit counter ( bit 2 ).
#define WWDG_CR_T1	1		//	7-bit counter ( bit 1 ).
#define WWDG_CR_T0	0		//	7-bit counter ( bit 0 ).

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : IWDG ( Independent watchdog timer ).

#if defined(using_iwdg)

#define IWDG_KR		*(unsigned char*) 0x50E0		//	IWDG key register.
#define IWDG_PR		*(unsigned char*) 0x50E1		//	IWDG prescalar register.
#define IWDG_RLR	*(unsigned char*) 0x50E2		//	IWDG reload register.	

//	Register name : IWDG_PR.

#define IWDG_PR_PR2	2
#define IWDG_PR_PR1	1
#define IWDG_PR_PR0	0 

#endif	

//__________________________________________________________________________________________________________________________________________________________

//	Block name : AWU ( Auto wakeup unit ).

#if defined(using_awu)

#define AWU_CSR1	*(unsigned char*) 0x50F0		//	AWU control/status register 1.
#define AWU_APR		*(unsigned char*) 0x50F1		//	AWU asynchronous prescalar buffer register.
#define AWU_TBR		*(unsigned char*) 0x50F2		//	AWU timebase selection register.

//	Register name : AWU_CSR.

#define AWU_CSR_AWUF	5		//	Auto-wakeup flag.
#define AWU_CSR_AWEN	4		//	Auto-wakeup enable.
#define AWU_CSR_MSR	0		//	Measurement enable.

//	Register name : AWU_TBR.

#define AWU_TBR_AWUTB3	3		//	Auto-wakeup timebase selection bit 3.
#define AWU_TBR_AWUTB2	2		//	Auto-wakeup timebase selection bit 2.
#define AWU_TBR_AWUTB1	1		//	Auto-wakeup timebase selection bit 1.
#define AWU_TBR_AWUTB0	0		//	Auto-wakeup timebase selection bit 0.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : BEEP

#if defined(using_beep)

#define BEEP_CSR	*(unsigned char*) 0x50F3	//	Beep control/status register.

//	Register name : BEEP_CSR.

#define BEEP_CSR_BEEPSEL1	7		//	Beep selection bit 1.
#define BEEP_CSR_BEEPSEL0	6		//	Beep selection bit 0.
#define BEEP_CSR_BEEPEN		5		//	Beep enable.
#define BEEP_CSR_BEEPDIV4	4		//	Beep prescale divider bit 4.		
#define BEEP_CSR_BEEPDIV3	3		//	Beep prescale divider bit 3.
#define BEEP_CSR_BEEPDIV2	2		//	Beep prescale divider bit 2.
#define BEEP_CSR_BEEPDIV1	1		//	Beep prescale divider bit 1.
#define BEEP_CSR_BEEPDIV0	0		//	Beep prescale divider bit 0.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : SPI.

#if defined(using_spi)

#define SPI_CR1		*(unsinged char*) 0x5200	//	SPI control register 1.
#define SPI_CR2		*(unsigned char*) 0x5201	//	SPI control register 2.
#define SPI_ICR		*(unsigned char*) 0x5202	//	SPI interrupt control register.
#define SPI_SR		*(unsigned char*) 0x5203	//	SPI status register.
#define SPI_DR		*(unsigned char*) 0x5204	//	SPI data register.
#define SPI_CRCPR	*(unsigned char*) 0x5205	//	SPI CRC polynomial register.
#define SPI_RXCRCR	*(unsigned char*) 0x5206	//	SPI Rx CRC register.
#define SPI_TXCRCR	*(unsigned char*) 0x5207	//	SPI Tx CRC register.

//	Register name : SPI_CR1.

#define SPI_CR1_LSBFIRST	7		//	LSB first.
#define SPI_CR1_SPE	 	6		//	SPI enable.
#define SPI_CR1_BR2		5		//	Baud rate control bit 2
#define SPI_CR1_BR1		4		//	Baud rate control bit 1.
#define SPI_CR1_BR0		3		//	Baud rate control bit 0.
#define SPI_CR1_MSTR		2		//	Master selection.
#define SPI_CR1_CPOL		1		//	Clock polarity.
#define SPI_CR1_CPHA		0		//	Clock phase.

//	Register name : SPI_CR2.

#define SPI_CR2_BDM		7		//	Bidirectional data mode enable.
#define SPI_CR2_BDOE		6		//	Input or output enable in bidirectional mode.
#define SPI_CR2_CRCEN		5		//	Hardware CRC calculation enable.
#define SPI_CR2_CRCNEXT		4		//	Transmit CRC next.
#define SPI_CR2_RXONLY		2		//	Receive only.
#define SPI_CR2_SSM		1		//	Software slave management.
#define SPI_CR2_SSI		0		//	Internal slave select bit.

//	Register name : SPI_ICR.

