ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
#define SPI_ICR_TXIE		7		//	Tx buffer empty interrupt enable.
#define SPI_ICR_RXIE		6		//	Rx buffer not empty interrupt enable.
#define SPI_ICR_ERRIE		5		//	Error interrupt enable.
#define SPI_ICR_WKIE		4		//	Wakeup interrupt enable.

//	Register name : SPI_SR.

#define SPI_SR_BSY		7		//	Busy flag.
#define SPI_SR_OVR		6		//	Overrun flag.
#define SPI_SR_MODF		5		//	Mode fault.
#define SPI_SR_CRCERR		4		//	CRC error flag.
#define SPI_SR_WKUP		3		//	Wakeup flag.
#define SPI_SR_TXE		1		//	Transmit buffer empty.
#define SPI_SR_RXNE		0		//	Receive buffer not empty.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : I2C.

#if defined(using_i2c)

#define I2C_CR1		*(unsigned char*) 0x5210	//	I2C control register 1.
#define I2C_CR2		*(unsigned char*) 0x5211	//	I2C control register 2.
#define I2C_FREQR	*(unsigned char*) 0x5212	//	I2C frequency register.
#define I2C_OARL	*(unsigned char*) 0x5213	//	I2C own address register low.
#define I2C_OARH	*(unsigned char*) 0x5214	//	I2C own address register high.
#define I2C_DR		*(unsigned char*) 0x5216	//	I2C data register.
#define I2C_SR1		*(unsigned char*) 0x5217	//	I2C status register 1.
#define I2C_SR2		*(unsigned char*) 0x5218	//	I2C status register 2.
#define I2C_SR3		*(unsigned char*) 0x5219	//	I2C status register 3.
#define I2C_ITR		*(unsigned char*) 0x521A	//	I2C interrupt control register.
#define I2C_CCRL	*(unsigned char*) 0x521B	//	I2C clock control register low.
#define I2C_CCRH	*(unsigned char*) 0x521C	//	I2C clock contrl register high.
#define I2C_TRISER	*(unsigned char*) 0x521D	//	I2C TRISE register.
#define I2C_PECR	*(unsigned char*) 0x521E	//	I2C 

//	Register name : I2C_CR1.

#define I2C_CR1_NOSTRETCH		7		//	Clock stretching disable.
#define I2C_CR1_ENGC			6		//	General call enable.
#define I2C_CR1_PE			0		//	Peripheral enable.

//	Register name : I2C_CR2.

#define I2C_CR2_SWRST			7		//	Software reset.
#define I2C_CR2_POS			3		//	Acknowledgement bit ( for data reception ).
#define I2C_CR2_ACK			2		//	Acknowledgement enable.
#define I2C_CR2_STOP			1		//	Stop generation.
#define I2C_CR2_START			0		//	Start generation.

//	Register name : I2C_FREQR.

#define I2C_FREQR_FREQ5		5		//	Peripheral clock frequency bit 5.
#define I2C_FREQR_FREQ4		4		//	Peripheral clock frequency bit 4.
#define I2C_FREQR_FREQ3		3		//	Peripheral clock frequency bit 3.
#define I2C_FREQR_FREQ2		2		//	Peripheral clock frequency bit 2.
#define I2C_FREQR_FREQ1		1		//	Peripheral clock frequency bit 1.
#define I2C_FREQR_FREQ0		0		//	Peripheral clock frequency bit 0.

//	Register name : I2C_OARH.

#define I2C_OARH_ADDMODE		7		//	Addressing mode ( slave mode ).
#define I2C_OARH_ADDCONF		6		//	Address mode configuration.
#define I2C_OARH_ADD9			2		//	Interface address bit 9.
#define I2C_OARH_ADD8			1		//	Interface address bit 8.

//	Register name : I2C_SR1.

#define I2C_SR1_TXE			7		//	Data register empty.
#define I2C_SR1_RXNE			6		//	Data register not empty.
#define I2C_SR1_STOPF			4		//	Stop detection ( slave mode ).
#define I2C_SR1_ADD10			3		//	10-bit header sent.
#define I2C_SR1_BTF			2		//	Byte transfer finished.
#define I2C_SR1_ADDR			1		//	Address sent ( master mode ) , Address matched ( slave mode ).
#define I2C_SR1_SB			0		//	Start bit ( master mode ).

//	Register name : I2C_SR2.

#define I2C_SR2_WUFH			5		//	Wakeup from halt.
#define I2C_SR2_OVR			3		//	Overrun ot underrun.
#define I2C_SR2_AF			2		//	Acknowledgement faliure.
#define I2C_SR2_ARLO			1		//	Arbitration lost ( master mode ).
#define I2C_SR2_BERR			0		//	Bus error.

//	Register name : I2C_SR3.

#define I2C_SR3_DUALF			7		//	Dual flag ( slave mode ).
#define I2C_SR3_GENCALL			4		//	General call header ( slave mode ).
#define I2C_SR3_TRA			2		//	Transmitter or receiver.
#define I2C_SR3_BUSY			1		//	Bus busy.
#define I2C_SR3_MSL			0		//	Master or slave mode.

//	Register name : I2C_ITR.

#define I2C_ITR_ITBUFEN			2		//	Buffer interrupt enable.
#define I2C_ITR_ITEVTEN			1		//	Event interrupt enable.
#define I2C_ITR_ITERREN			0		//	Error interrupt enable.

//	Register name : I2C_CCRH.

#define I2C_CCRH_FS			7		//	I2C master mode selection.
#define I2C_CCRH_DUTY			6		//	Fast mode duty cycle.
#define I2C_CCRH_CCR11			3		//	Clock control register in Fast/Standard mode , bit 11.
#define I2C_CCRH_CCR10			2		//	Clock control register in Fast/Standard mode , bit 10.
#define I2C_CCRH_CCR9			1		//	Clock control register in Fast/Standard mode , bit 9.	
#define I2C_CCRH_CCR8			0		//	Clock control register in Fast/Standard mode , bit 8.

//	Register name : I2C_TRISER.

#define I2C_TRISER_TRISE5		5		//	Maximum rise time in Fast/Standard mode , bit 5. 
#define I2C_TRISER_TRISE4		4		//	Maximum rise time in Fast/Standard mode , bit 4.
#define I2C_TRISER_TRISE3		3		//	Maximum rise time in Fast/Standard mode , bit 3.
#define I2C_TRISER_TRISE2		2		//	Maximum rise time in Fast/Standard mode , bit 2.
#define I2C_TRISER_TRISE1		1		//	Maximum rise time in Fast/Standard mode , bit 1.
#define I2C_TRISER_TRISE0		0		//	Maximum rise time in Fast/Standard mode , bit 0.

#endif
 
//__________________________________________________________________________________________________________________________________________________________

//	Block name : UART1.

#if defined(using_uart1)

#define UART1_SR	*(unsigned char*) 0x5230		//	UART1 status register.
#define UART1_DR	*(unsigned char*) 0x5231		//	UART1 data register.
#define UART1_BRR1	*(unsigned char*) 0x5232		//	UART1 baud rate register 1.
#define UART1_BRR2	*(unsigned char*) 0x5233		//	UART1 baud rate register 2.
#define UART1_CR1	*(unsigned char*) 0x5234		//	UART1 control register 1.
#define UART1_CR2	*(unsigned char*) 0x5235		//	UART1 control register 2.
#define UART1_CR3	*(unsigned char*) 0x5236		//	UART1 control register 3.
#define UART1_CR4	*(unsigned char*) 0x5237		//	UART1 control register 4.
#define UART1_CR5	*(unsigned char*) 0x5238		//	UART1 control register 5.
#define UART1_GTR	*(unsigned char*) 0x5239		//	UART1 guard time register.
#define UART1_PSCR	*(unsigned char*) 0x523A		//	UART1 prescaler register.

