ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
//	Register name : UART1_SR

#define UART1_SR_TXE			7		//	Transmit data register empty.
#define UART1_SR_TC			6		//	Transmission complete.
#define UART1_SR_RXNE			5		//	Read data register not empty.
#define UART1_SR_IDLE			4		//	IDLE line detected.
#define UART1_SR_OR			3		//	Overrun error.
#define UART1_SR_NF			2		//	Noise flag.
#define UART1_SR_FE 			1		//	Framing error.
#define UART1_SR_PE			0		//	Parity error.

//	Register name : UART1_CR1.

#define UART1_CR1_UART1_CR1_R8			7		//	Receive data bit 8.
#define UART1_CR1_T8				6		//	Transmit data bit 8.
#define UART1_CR1_UARTD				5		//	UART Disable.
#define UART1_CR1_M				4		//	word length.
#define UART1_CR1_WAKE				3		//	Wakeup method.
#define UART1_CR1_PCEN				2		//	Parity control enable.
#define UART1_CR1_PS				1		//	Parity selection.
#define UART1_CR1_PIEN				0		//	Parity interrupt enable.

//	Register name : UART1_CR2.

#define UART1_CR2_TIEN				7		//	Transmitter interrupt enable.
#define UART1_CR2_TCIEN				6		//	Transmission complete interrupt enable.
#define UART1_CR2_RIEN				5		//	Receive interrupt enable.
#define UART1_CR2_ILIEN				4		//	IDLE line interrupt enable.
#define UART1_CR2_TEN				3		//	Transmitter enable.
#define UART1_CR2_REN				2		//	Receiver enable.
#define UART1_CR2_RWU				1		//	Receiver wakeup.
#define UART1_CR2_SBK				0		//	Send break.

//	Register name : UART1_CR3.

#define UART1_CR3_LINEN				6		//	LIN mode enable.
#define UART1_CR3_STOP1				5		//	STOP bit 1.
#define UART1_CR3_STOP0				4		//	STOP bit 0.
#define UART1_CR3_CLKEN				3		//	Clock enable.
#define UART1_CR3_CPOL				2		//	Clock polarity.
#define UART1_CR3_CPHA				1		//	Clock phase.
#define UART1_CR3_LBCL				0		//	Last bit clock pulse.

//	Register name : UART1_CR4.

#define UART1_CR4_LBDIEN			6		//	LIN break detection interrupt enable.
#define UART1_CR4_LBDL				5		//	LIN break detection length.
#define UART1_CR4_LBDF				4		//	LIN break detection flag.
#define UART1_CR4_ADD3				3		//	Address of UART node , bit 3.
#define UART1_CR4_ADD2				2		//	Address of UART node , bit 2.
#define UART1_CR4_ADD1				1		//	Address of UART node , bit 1.
#define UART1_CR4_ADD0				0		//	Address of UART node , bit 0.

//	Register name : UART1_CR5.

#define UART1_CR5_SCEN				5		//	Smartcard mode enable.
#define UART1_CR5_NACK				4		//	Smartcard NACK enable.
#define UART1_CR5_HDSEL				3		//	Half duplex selection.
#define UART1_CR5_IRLP				2		//	IrDA low power.
#define UART1_CR5_IREN				1		//	IrDA mode enable.

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name	:	TIM1.

#if defined(using_tim1)

#define TIM1_CR1	*(unsigned char*) 0x5250		//	TIM1 control register 1.
#define TIM1_CR2	*(unsigned char*) 0x5251		//	TIM1 control register 2.
#define TIM1_SMCR	*(unsigned char*) 0x5252		//	TIM1 slave mode control register.
#define TIM1_ETR	*(unsigned char*) 0x5253		//	TIM1 external trigger register.
#define TIM1_IER	*(unsigned char*) 0x5254		//	TIM1 interrupt enable register.
#define TIM1_SR1	*(unsigned char*) 0x5255		//	TIM1 status register 1.
#define TIM1_SR2	*(unsigned char*) 0x5256		//	TIM1 status register 2.
#define TIM1_EGR	*(unsigned char*) 0x5257		//	TIM1 event generation register.
#define TIM1_CCMR1	*(unsigned char*) 0x5258		//	TIM1 capture/compare mode resigter 1.
#define TIM1_CCMR2	*(unsigned char*) 0x5259		//	TIM1 capture/compare mode resigter 2.
#define TIM1_CCMR3	*(unsigned char*) 0x525A		//	TIM1 capture/compare mode resigter 3.  
#define TIM1_CCMR4	*(unsigned char*) 0x525B		//	TIM1 capture/compare mode resigter 4. 
#define TIM1_CCER1	*(unsigned char*) 0x525C		//	TIM1 capture/compare enable resigter 1. 
#define TIM1_CCER2	*(unsigned char*) 0x525D		//	TIM1 capture/compare enable resigter 2.
#define TIM1_CNTRH	*(unsigned char*) 0x525E		//	TIM1 counter high.
#define TIM1_CNTRL	*(unsigned char*) 0x525F		//	TIM1 counter low.
#define TIM1_PSCRH	*(unsigned char*) 0x5260		//	TIM1 prescaler register high.
#define TIM1_PSCRL	*(unsigned char*) 0x5261		//	TIM1 prescaler register low.
#define TIM1_ARRH	*(unsigned char*) 0x5262		//	TIM1 auto reload register high.
#define TIM1_ARRL	*(unsigned char*) 0x5263		//	TIM1 auto reload register low.
#define TIM1_RCR	*(unsigned char*) 0x5264		//	TIM1 repitition counter register.
#define TIM1_CCR1H	*(unsigned char*) 0x5265		//	TIM1 capture/compare register 1 high.
#define TIM1_CCR1L	*(unsigned char*) 0x5266		//	TIM1 capture/compare register 1 low.
#define TIM1_CCR2H	*(unsigned char*) 0x5267		//	TIM1 capture/compare register 2 high.
#define TIM1_CCR2L	*(unsigned char*) 0x5268		//	TIM1 capture/compare register 2 low.
#define TIM1_CCR3H	*(unsigned char*) 0x5269		//	TIM1 capture/compare register 3 high.
#define TIM1_CCR3L	*(unsigned char*) 0x526A		//	TIM1 capture/compare register 3 low.
#define TIM1_CCR4H	*(unsigned char*) 0x526B		//	TIM1 capture/compare register 4 high.
#define TIM1_CCR4L	*(unsigned char*) 0x526C		//	TIM1 capture/compare register 4 low.
#define TIM1_BKR	*(unsigned char*) 0x526D		//	TIM1 break register.
#define TIM1_DTR	*(unsigned char*) 0x526E		//	TIM1 dead-time register.
#define TIM1_OISR	*(unsigned char*) 0x526F		//	TIM1 output idle state register.

//	Register name :	TIM1_CR1.

#define TIM1_CR1_ARPE		7		//	Auto-reload preload enable.
#define TIM1_CR1_CMS1		6		//	Center-aligned mode selection bit 1.
#define TIM1_CR1_CMS0		5		//	Center-aligned mode selection bit 0.
#define TIM1_CR1_DIR		4		//	Direction.
#define TIM1_CR1_OPM		3		//	One pulse mode.
#define TIM1_CR1_URS		2		//	Update request source.
#define TIM1_CR1_UDIS		1		//	Update disable.
#define TIM1_CR1_CEN		0		//	Counter enable.

//	Register name : TIM1_CR2.

#define TIM1_CR2_MMS2		6		//	Master mode selection bit 2.
#define TIM1_CR2_MMS1		5		//	Master mode selection bit 1.
#define TIM1_CR2_MMS0		4		//	Master mod eselection bit 0.
#define TIM1_CR2_COMS		2		//	Capture/compare control update selection.
#define TIM1_CR2_CCPC		0		//	Capture/compare preloaded control.

//	Register name : TIM1_SMCR.

