ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
#define TIM1_SMCR_MSM		7		//	Master/Slave mode.
#define TIM1_SMCR_TS2		6		//	Trigger selection bit 2.
#define TIM1_SMCR_TS1		5		//	Trigger selection bit 1.
#define TIM1_SMCR_TS0		4		//	Trigger selection bit 0.
#define TIM1_SMCR_SMS2		2		//	Clock/trigger/slave mode selection bit 2.
#define TIM1_SMCR_SMS1		1		//	Clock/trigger/slave mode selection bit 1.
#define TIM1_SMCR_SMS0		0		//	Clock/trigger/slave mode selection bit 0.

//	Register name : TIM1_ETR.

#define TIM1_ETR_ETP		7		//	External trigger polarity.
#define TIM1_ETR_ECE		6		//	External clock enable.
#define TIM1_ETR_ETPS1		5		//	External trigger prescalar bit 1.
#define TIM1_ETR_ETPS0		4		//	External trigger prescalar bit 0.
#define TIM1_ETR_ETF3		3		//	External trigger filter bit 3.
#define TIM1_ETR_ETF2		2		//	External trigger filter bit 2.
#define TIM1_ETR_ETF1		1		//	External trigger filter bit 1.
#define TIM1_ETR_ETF0		0		//	External trigger filter bit 0.

//	Register name : TIM1_IER.

#define TIM1_IER_BIE		7		//	Break interrupt enable.
#define TIM1_IER_TIE		6		//	Trigger interrupt enable.
#define TIM1_IER_COMIE		5		//	Commutation interrupt enable.
#define TIM1_IER_CC4IE		4		//	Capture/compare 4 interrupt enable.
#define TIM1_IER_CC3IE		3		//	Capture/compare 3 interrupt enable.
#define TIM1_IER_CC2IE		2		//	Capture/compare 2 interrupt enable.
#define TIM1_IER_CC1IE		1		//	Capture/compare 1 interrupt enable.
#define TIM1_IER_UIE		0		//	Update interrupt enable.

//	Register name : TIM1_SR1.

#define TIM1_SR1_BIF		7		//	Break interrupt flag.
#define TIM1_SR1_TIF		6		//	Trigger interrupt flag.
#define TIM1_SR1_COMIF	5		//	Commutation interrupt flag.
#define TIM1_SR1_CC4IF		4		//	Capture/compare 4 interrupt flag.
#define TIM1_SR1_CC3IF		3		//	Capture/compare 3 interrupt flag.
#define TIM1_SR1_CC2IF		2		//	Capture/compare 2 interrupt flag.
#define TIM1_SR1_CC1IF		1		//	Capture/compare 1 interrupt flag.
#define TIM1_SR1_UIF		0		//	Update interrupt flag.

//	Register name : TIM1_SR2.

#define TIM1_SR2_CC4OF		4		//	Capture/compare 4 overcapture flag.
#define TIM1_SR2_CC3OF		3		//	Capture/compare 3 overcapture flag.
#define TIM1_SR2_CC2OF		2		//	Capture/compare 2 overcapture flag.
#define TIM1_SR2_CC1OF		1		//	Capture/compare 1 overcapture flag.

//	Register name : TIM1_EGR.

#define TIM1_EGR_BG		7		//	Break generation.
#define TIM1_EGR_TG		6		//	Trigger generation.
#define TIM1_EGR_COMG		5		//	Capture/compare control update generation.
#define TIM1_EGR_CC4G		4		//	Capture/compare 4 generation.
#define TIM1_EGR_CC3G		3		//	Capture/compare 3 generation.
#define TIM1_EGR_CC2G		2		//	Capture/compare 2 generation.
#define TIM1_EGR_CC1G		1		//	Capture/compare 1 generation.
#define TIM1_EGR_UG		0		//	Update generation.

//	Register name : TIM1_CCMR1.

//	Output mode bits.

#define TIM1_CCMR1_OC1CE		7		//	Output compare 1 clear enable.
#define TIM1_CCMR1_OC1M2		6		//	Output compare 1 mode ( bit 2 ).
#define TIM1_CCMR1_OC1M1		5		//	Output compare 1 mode ( bit 1 ).
#define TIM1_CCMR1_OC1M0		4		//	Output compare 1 mode ( bit 0 ).
#define TIM1_CCMR1_OC1PE		3		//	Output compare 1 preload enable.
#define TIM1_CCMR1_OC1FE		2		//	Output compare 1 fast enable.
#define TIM1_CCMR1_CC1S1		1		//	Capture/compare 1 selection ( bit 1 ).
#define TIM1_CCMR1_CC1S0		0		//	Capture/compare 1 selection ( bit 0 ).

//	Input mode bits.

#define TIM1_CCMR1_IC1F3		7		//	Input capture 1 filter ( bit 3 ).
#define TIM1_CCMR1_IC1F2		6		//	Input capture 1 filter ( bit 2 ).
#define TIM1_CCMR1_IC1F1		5		//	Input capture 1 filter ( bit 1 ).
#define TIM1_CCMR1_IC1F0		4		//	Input capture 1 filter ( bit 0 ).
#define TIM1_CCMR1_IC1PSC1		3		//	Input capture 1 prescalar ( bit 1 ).
#define TIM1_CCMR1_IC1PSC0		2		//	Input capture 1 prescalar ( bit 0 ).
#define TIM1_CCMR1_CC1S1		1		//	Capture/compare 1 selection ( bit 1 ).
#define TIM1_CCMR1_CC1S0		0		//	Capture/compare 1 selection ( bit 0 ).

//	Register name : TIM1_CCMR2.

//	Output mode bits.

#define TIM1_CCMR2_OC2CE		7		//	Output compare 2 clear enable.
#define TIM1_CCMR2_OC2M2		6		//	Output compare 2 mode ( bit 2 ).
#define TIM1_CCMR2_OC2M1		5		//	Output compare 2 mode ( bit 1 ).
#define TIM1_CCMR2_OC2M0		4		//	Output compare 2 mode ( bit 0 ).
#define TIM1_CCMR2_OC2PE		3		//	Output compare 2 preload enable.
#define TIM1_CCMR2_OC2FE		2		//	Output compare 2 fast enable.
#define TIM1_CCMR2_CC2S1		1		//	Capture/compare 2 selection ( bit 1 ).
#define TIM1_CCMR2_CC2S0		0		//	Capture/compare 2 selection ( bit 0 ).

//	Input mode bits.

#define TIM1_CCMR2_IC2F3		7		//	Input capture 2 filter ( bit 3 ).
#define TIM1_CCMR2_IC2F2		6		//	Input capture 2 filter ( bit 2 ).
#define TIM1_CCMR2_IC2F1		5		//	Input capture 2 filter ( bit 1 ).
#define TIM1_CCMR2_IC2F0		4		//	Input capture 2 filter ( bit 0 ).
#define TIM1_CCMR2_IC2PSC1		3		//	Input capture 2 prescalar ( bit 1 ).
#define TIM1_CCMR2_IC2PSC0		2		//	Input capture 2 prescalar ( bit 0 ).
#define TIM1_CCMR2_CC2S1		1		//	Capture/compare 2 selection ( bit 1 ).
#define TIM1_CCMR2_CC2S0		0		//	Capture/compare 2 selection ( bit 0 ).

//	Register name : TIM1_CCMR3.

//	Output mode bits.

#define TIM1_CCMR3_OC3CE		7		//	Output compare 3 clear enable.
#define TIM1_CCMR3_OC3M2		6		//	Output compare 3 mode ( bit 2 ).
#define TIM1_CCMR3_OC3M1		5		//	Output compare 3 mode ( bit 1 ).
#define TIM1_CCMR3_OC3M0		4		//	Output compare 3 mode ( bit 0 ).
#define TIM1_CCMR3_OC3PE		3		//	Output compare 3 preload enable.
#define TIM1_CCMR3_OC3FE		2		//	Output compare 3 fast enable.
#define TIM1_CCMR3_CC3S1		1		//	Capture/compare 3 selection ( bit 1 ).
#define TIM1_CCMR3_CC3S0		0		//	Capture/compare 3 selection ( bit 0 ).

//	Input mode bits.

#define TIM1_CCMR3_IC3F3		7		//	Input capture 3 filter ( bit 3 ).
#define TIM1_CCMR3_IC3F2		6		//	Input capture 3 filter ( bit 2 ).
#define TIM1_CCMR3_IC3F1		5		//	Input capture 3 filter ( bit 1 ).
#define TIM1_CCMR3_IC3F0		4		//	Input capture 3 filter ( bit 0 ).
#define TIM1_CCMR3_IC3PSC1		3		//	Input capture 3 prescalar ( bit 1 ).
#define TIM1_CCMR3_IC3PSC0	2		//	Input capture 3 prescalar ( bit 0 ).
#define TIM1_CCMR3_CC3S1		1		//	Capture/compare 3 selection ( bit 1 ).
#define TIM1_CCMR3_CC3S0		0		//	Capture/compare 3 selection ( bit 0 ).

