ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
//	Register name : TIM1_CCMR4.

//	Output mode bits.

#define TIM1_CCMR4_OC4CE		7		//	Output compare 4 clear enable.
#define TIM1_CCMR4_OC4M2		6		//	Output compare 4 mode ( bit 2 ).
#define TIM1_CCMR4_OC4M1		5		//	Output compare 4 mode ( bit 1 ).
#define TIM1_CCMR4_OC4M0		4		//	Output compare 4 mode ( bit 0 ).
#define TIM1_CCMR4_OC4PE		3		//	Output compare 4 preload enable.
#define TIM1_CCMR4_OC4FE		2		//	Output compare 4 fast enable.
#define TIM1_CCMR4_CC4S1		1		//	Capture/compare 4 selection ( bit 1 ).
#define TIM1_CCMR4_CC4S0		0		//	Capture/compare 4 selection ( bit 0 ).

//	Input mode bits.

#define TIM1_CCMR4_IC4F3		7		//	Input capture 4 filter ( bit 3 ).
#define TIM1_CCMR4_IC4F2		6		//	Input capture 4 filter ( bit 2 ).
#define TIM1_CCMR4_IC4F1		5		//	Input capture 4 filter ( bit 1 ).
#define TIM1_CCMR4_IC4F0		4		//	Input capture 4 filter ( bit 0 ).
#define TIM1_CCMR4_IC4PSC1		3		//	Input capture 4 prescalar ( bit 1 ).
#define TIM1_CCMR4_IC4PSC0		2		//	Input capture 4 prescalar ( bit 0 ).
#define TIM1_CCMR4_CC4S1		1		//	Capture/compare 4 selection ( bit 1 ).
#define TIM1_CCMR4_CC4S0		0		//	Capture/compare 4 selection ( bit 0 ).

//	Register name : TIM1_CCER1.

#define TIM1_CCER1_CC2NP		7		//	Capture/compare 2 complementary output polarity.
#define TIM1_CCER1_CC2NE		6		//	Capture/compare 2 complementary output enable.
#define TIM1_CCER1_CC2P		5		//	Capture/compare 2 output polarity.
#define TIM1_CCER1_CC2E		4		//	Capture/compare 2 output enable.
#define TIM1_CCER1_CC1NP		3		//	Capture/compare 1 complementary output polarity.
#define TIM1_CCER1_CC1NE		2		//	Capture/compare 1 complementary output enable.
#define TIM1_CCER1_CC1P		1		//	Capture/compare 1 output polarity.
#define TIM1_CCER1_CC1E		0		//	Capture/compare 1 output enable. 

//	Register name : TIM1_CCER2.

#define TIM1_CCER2_CC4P		5		//	Capture/compare 4 output polarity.
#define TIM1_CCER2_CC4E		4		//	Capture/compare 4 output enable.
#define TIM1_CCER2_CC3NP		3		//	Capture/compare 3 complementary output polarity.
#define TIM1_CCER2_CC3NE		2		//	Capture/comapre 3 complementary output enable.
#define TIM1_CCER2_CC3P		1		//	Capture/compare 3 output polarity.
#define TIM1_CCER2_CC3E		0		//	Capture/compare 3 output enable.

//	Register name : TIM1_BKR.

#define TIM1_BKR_MOE_TIM1		7		//	Main output enable.
#define TIM1_BKR_AOE_TIM1		6		//	Automatic output enable.
#define TIM1_BKR_BKP_TIM1		5		//	Break polarity.
#define TIM1_BKR_BKE_TIM1		4		//	Break enable.
#define TIM1_BKR_OSSR_TIM1		3		//	Off-state selection for run mode.
#define TIM1_BKR_OSSI_TIM1		2		//	Off-state selection for idle mode.
#define TIM1_BKR_LOCK1_TIM1		1		//	Lock configuration ( bit 1 ).
#define TIM1_BKR_LOCK0_TIM1		0		//	Lokc configuration ( bit 0 ).

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : TMR2.

#if defined(using_tim2)

#define TIM2_CR1	*(unsigned char*) 0x5300		//	TIM2 control register 1.
#define TIM2_IER	*(unsigned char*) 0x5303		//	TIM2 interrupt enable register.
#define TIM2_SR1	*(unsigned char*) 0x5304		//	TIM2 status register 1.
#define TIM2_SR2	*(unsigned char*) 0x5305		//	TIM2 status register 2.
#define TIM2_EGR	*(unsigned char*) 0x5306		//	TIM2 event generation register.
#define TIM2_CCMR1	*(unsigned char*) 0x5307		//	TIM2 capture/compare mode register 1.
#define TIM2_CCMR2	*(unsigned char*) 0x5308		//	TIM2 capture/compare mode register 2.
#define TIM2_CCMR3	*(unsigned char*) 0x5309		//	TIM2 capture/compare mode register 3.
#define TIM2_CCER1	*(unsigned char*) 0x530A		//	TIM2 capture/compare enable register 1.
#define TIM2_CCER2	*(unsigned char*) 0x530B		//	TIM2 capture/compare enable register 2.
#define TIM2_CNTRH	*(unsigned char*) 0x530C		//	TIM2 counter high.
#define TIM2_CNTRL	*(unsigned char*) 0x530D		//	TIM2 counter low.
#define TIM2_PSCR	*(unsigned char*) 0x530E		//	TIM2 prescalar register.
#define TIM2_ARRH	*(unsigned char*) 0x530F		//	TIM2 auto-reload register high.
#define TIM2_ARRL	*(unsigned char*) 0x5310		//	TIM2 auto-reload register low.
#define TIM2_CCR1H	*(unsigned char*) 0x5311		//	TIM2 capture/compare register 1 high.
#define TIM2_CCR1L	*(unsigned char*) 0x5312		//	TIM2 capture/compare register 1 low.
#define TIM2_CCR2H	*(unsigned char*) 0x5313		//	TIM2 capture/compare register 2 high.
#define TIM2_CCR2L	*(unsigned char*) 0x5314		//	TIM2 capture/compare register 2 low.
#define TIM2_CCR3H	*(unsigned char*) 0x5315		//	TIM2 capture/compare register 3 high.
#define TIM2_CCR3L	*(unsigned char*) 0x5316		//	TIM2 capture/compare register 3 low.

//	Register name : TIM2_CR1.

#define TIM2_CR1_APRE		7		//	Auto-reload preload enable.
#define TIM2_CR1_OPM		3		//	One-pulse mode.
#define TIM2_CR1_URS		2		//	Update request source.
#define TIM2_CR1_UDIS		1		//	Update disable.
#define TIM2_CR1_CEN		0		//	Counter enable.

//	Register name : TIM2_IER.

#define TIM2_IER_TIE		6		//	Trigger interrupt enable.
#define TIM2_IER_CC3IE		3		//	Capture/compare 3 interrupt enable.
#define TIM2_IER_CC2IE		2		//	Capture/compare 2 interrupt enable.
#define TIM2_IER_CC1IE		1		//	Capture/compare 1 interrupt enable.
#define TIM2_IER_UIE		0		//	Update interrupt enable.

//	Register name : TIM2_SR1.

#define TIM2_SR1_TIF		6		//	Trigger interrupt flag.
#define TIM2_SR1_CC3IF		3		//	Capture/compare 3 interrupt flag.
#define TIM2_SR1_CC2IF		2		//	Capture/compare 2 interrupt flag.
#define TIM2_SR1_CC1IF		1		//	Capture/compare 1 interrupt flag.
#define TIM2_SR1_UIF		0		//	Update interrupt flag.

//	Register name : TIM2_SR2.

#define TIM2_SR2_CC3OF_TIM2		3		//	Capture/compare 3 overcapture flag.
#define TIM2_SR2_CC2OF_TIM2		2		//	Capture/compare 2 overcapture flag.
#define TIM2_SR2_CC1OF_TIM2		1		//	Capture/compare 1 overcapture flag.

//	Register name : TIM2_EGR.

#define TIM2_EGR_TG	6		//	Trigger generation.
#define TIM2_EGR_CC3G		3		//	Capture/compare 3 generation.
#define TIM2_EGR_CC2G		2		//	Capture/compare 2 generation.
#define TIM2_EGR_CC1G		1		//	Capture/compare 1 generation.
#define TIM2_EGR_UG		0		//	Update generation.

//	Register name : TIM2_CCMR1.

