ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
//	Channel configured in output 

#define TIM2_CCMR1_OC1M2		6		//	Output compare 1 mode ( bit 2 ).
#define TIM2_CCMR1_OC1M1		5		//	Output compare 1 mode ( bit 1 ).
#define TIM2_CCMR1_OC1M0		4		//	Output compare 1 mode ( bit 0 ).
#define TIM2_CCMR1_OC1PE		3		//	Output compare 1 preload enable.
#define TIM2_CCMR1_CC1S1		1		//	Capture/compare 1 selection ( bit 1 ).
#define TIM2_CCMR1_CC1S0		0		//	Capture/compare 1 selection ( bit 0 ).

//	Channel configured in input.

#define TIM2_CCMR1_IC1F3		7		//	Input capture 1 filter ( bit 3 ).
#define TIM2_CCMR1_IC1F2		6		//	Input capture 1 filter ( bit 2 ).
#define TIM2_CCMR1_IC1F1		5		//	Input capture 1 filter ( bit 1 ).
#define TIM2_CCMR1_IC1F0		4		//	Input capture 1 filter ( bit 0 ).
#define TIM2_CCMR1_IC1PSC1		3		//	Input capture 1 prescaler ( bit 1 ).
#define TIM2_CCMR1_IC1PSC0		2		//	Input capture 1 prescaler ( bit 0 ).
#define TIM2_CCMR1_CC1S1		1		//	Capture/compare 1 selection ( bit 1 ).
#define TIM2_CCMR1_CC1S0		0		//	Capture/compare 1 selection ( bit 0 ).

//	Register name : TIM2_CCMR2.

//	Channel configured in output 

#define TIM2_CCMR2_OC2M2		6		//	Output compare 2 mode ( bit 2 ).
#define TIM2_CCMR2_OC2M1		5		//	Output compare 2 mode ( bit 1 ).
#define TIM2_CCMR2_OC2M0		4		//	Output compare 2 mode ( bit 0 ).
#define TIM2_CCMR2_OC2PE		3		//	Output compare 2 preload enable.
#define TIM2_CCMR2_CC2S1		1		//	Capture/compare 2 selection ( bit 1 ).
#define TIM2_CCMR2_CC2S0		0		//	Capture/compare 2 selection ( bit 0 ).

//	Channel configured in input.

#define TIM2_CCMR2_IC2F3		7		//	Input capture 2 filter ( bit 3 ).
#define TIM2_CCMR2_IC2F2		6		//	Input capture 2 filter ( bit 2 ).
#define TIM2_CCMR2_IC2F1		5		//	Input capture 2 filter ( bit 1 ).
#define TIM2_CCMR2_IC2F0		4		//	Input capture 2 filter ( bit 0 ).
#define TIM2_CCMR2_IC2PSC1		3		//	Input capture 2 prescaler ( bit 1 ).
#define TIM2_CCMR2_IC2PSC0		2		//	Input capture 2 prescaler ( bit 0 ).
#define TIM2_CCMR2_CC2S1		1		//	Capture/compare 2 selection ( bit 1 ).
#define TIM2_CCMR2_CC2S0		0		//	Capture/compare 2 selection ( bit 0 ).
	
//	Register name : TIM2_CCER1.

#define TIM2_CCER1_CC2P		5		//	Capture/compare 2 output polarity.
#define TIM2_CCER1_CC2E		4		//	Capture/compare 2 output enable.
#define TIM2_CCER1_CC1P		1		//	Capture/compare 1 output polarity.
#define TIM2_CCER1_CC1E		0		//	Capture/compare 1 output enable.

//	Register name : TIM2_CCER2.

#define TIM2_CCER2_CC3P		1		//	Capture/compare 3 output polarity.
#define TIM2_CCER2_CC3E		0		//	Capture/compare 2 output enable.

//	Register name : TIM2_PSCR.

#define TIM2_PSCR_PSC3		3		//	Prescaler value ( bit 3 ).
#define TIM2_PSCR_PSC2		2		//	Prescaler value ( bit 2 ).
#define TIM2_PSCR_PSC1		1		//	Prescaler value ( bit 1 ).
#define TIM2_PSCR_PSC0		0		//	Prescaler value ( bit 0 ).

#endif

//__________________________________________________________________________________________________________________________________________________________

//	Block name : TIM4.

#if defined(using_tim4)

#define TIM4_CR1	*(unsigned char*) 0x5340		//	TIM4 control register.
#define TIM4_IER	*(unsigned char*) 0x5343		//	TIM4 interrupt enable register.
#define TIM4_SR		*(unsigned char*) 0x5344		//	TIM4 status register.
#define TIM4_EGR	*(unsigned char*) 0x5345		//	TIM4 event generation register.
#define TIM4_CNTR	*(unsigned char*) 0x5346		//	TIM4 counter.
#define TIM4_PSCR	*(unsigned char*) 0x5347		//	TIM4 prescaler register.
#define TIM4_ARR	*(unsigned char*) 0x5348		//	TIM4 auto-reload preload register.

//	Register name : TIM4_CR1.

#define TIM4_CR1_ARPE		7		//	Auto-reload preload enable.
#define TIM4_CR1_OPM		3		//	One-pulse mode.
#define TIM4_CR1_URS		2		//	Update request source.
#define TIM4_CR1_UDIS		1		//	Update disable.
#define TIM4_CR1_CEN		0		//	Counter enable.		

//	Register name : TIM4_IER.

#define TIM4_IER_TIE		6		//	Trigger interrupt enable.
#define TIM4_IER_UIE		0		//	Update interrupt enable.

//	Register name : TIM4_SR.

#define TIM4_SR_TIF		6		//	Trigger interrupt flag.
#define TIM4_SR_UIF		0		//	Update interrupt enable.

//	Register name : TIM4_EGR.

#define TIM4_EGR_TG			6		//	Trigger generation.
#define TIM4_EGR_UG			0		//	Update generation.

//	Register name : TIM4_PSCR.

#define TIM4_PSCR_PSC2		2		//	Prescaler value ( bit 2 ).
#define TIM4_PSCR_PSC1		1		//	Prescaler value ( bit 1 ).
#define TIM4_PSCR_PSC0		0		//	Prescaler value ( bit 0 ).

#endif

//__________________________________________________________________________________________________________________________________________________________

//Block name : ADC1.

#if defined(using_adc1)

#define ADC_DB0RH	*(unsigned char*) 0x53E0		//	ADC channel 0 high register.
#define ADC_DB0RL	*(unsigned char*) 0x53E1		//	ADC channel 0 low register.
#define ADC_DB1RH	*(unsigned char*) 0x53E2		//	ADC channel 1 high register.
#define ADC_DB1RL	*(unsigned char*) 0x53E3		//	ADC channel 1 low register.
#define ADC_DB2RH	*(unsigned char*) 0x53E4		//	ADC channel 2 high register.
#define ADC_DB2RL	*(unsigned char*) 0x53E5		//	ADC channel 2 low register.
#define ADC_DB3RH	*(unsigned char*) 0x53E6		//	ADC channel 3 high register.
#define ADC_DB3RL	*(unsigned char*) 0x53E7		//	ADC channel 3 low register.
#define ADC_DB4RH	*(unsigned char*) 0x53E8		//	ADC channel 4 high register.
#define ADC_DB4RL	*(unsigned char*) 0x53E9		//	ADC channel 4 low register.
#define ADC_DB5RH	*(unsigned char*) 0x53EA		//	ADC channel 5 high register.
#define ADC_DB5RL	*(unsigned char*) 0x53EB		//	ADC channel 5 low register.
#define ADC_DB6RH	*(unsigned char*) 0x53EC		//	ADC channel 6 high register.
#define ADC_DB6RL	*(unsigned char*) 0x53ED		//	ADC channel 6 low register.
#define ADC_DB7RH	*(unsigned char*) 0x53EE		//	ADC channel 7 high register.
#define ADC_DB7RL	*(unsigned char*) 0x53EF		//	ADC channel 7 low register.
#define ADC_DB8RH	*(unsigned char*) 0x53F0		//	ADC channel 8 high register.
#define ADC_DB8RL	*(unsigned char*) 0x53F1		//	ADC channel 8 low register.
#define ADC_DB9RH	*(unsigned char*) 0x53F2		//	ADC channel 9 high register.
#define ADC_DB9RL	*(unsigned char*) 0x53F3		//	ADC channel 9 low register.
#define ADC_CSR		*(unsigned char*) 0x5400		//	ADC control/status register.
#define ADC_CR1		*(unsigned char*) 0x5401		//	ADC configuration register 1.
#define ADC_CR2		*(unsigned char*) 0x5402		//	ADC configuration register 2.
#define ADC_CR3		*(unsigned char*) 0x5403		//	ADC configuration register 3.
#define ADC_DRH		*(unsigned char*) 0x5404		//	ADC data register high.
#define ADC_DRL		*(unsigned char*) 0x5405		//	ADC data register low.
#define ADC_TDRH	*(unsigned char*) 0x5406		//	ADC Schmitt trigger disable register high.
#define ADC_TDRL	*(unsigned char*) 0x5407		//	ADC Schmitt trigger disable register low.
#define ADC_HTRH	*(unsigned char*) 0x5408		//	ADC Schmitt trigger high threshold register high.
#define ADC_HTRL	*(unsigned char*) 0x5409		//	ADC Schmitt trigger high threshold register low.
#define ADC_LTRH	*(unsigned char*) 0x540A		//	ADC Schmitt trhgger low threshold register high.
#define ADC_LTRL	*(unsigned char*) 0x540B		//	ADC Schmitt trigger low threshold register low.
#define ADC_AWSRH	*(unsigned char*) 0x540C		//	ADC analog watchdog status register high.
#define ADC_AWSRL	*(unsigned char*) 0x540D		//	ADC analog watchdog status register low.
#define ADC_AWCRH	*(unsigned char*) 0x540E		//	ADC analog watchdog control register high.
#define ADC_AWCRL	*(unsigned char*) 0x540F		//	ADC analog watchdog control register low.

