ElectronicCircuitDesignTools/projects/stm8s103f3p6_register_map.h
//	Register name : ADC_CSR.

#define ADC_CSR_EOC		7		//	End of conversion.
#define ADC_CSR_AWD		6		//	Analog watchdog flag.
#define ADC_CSR_EOCIE		5		//	Interrupt enable for EOC.
#define ADC_CSR_AWDIE		4		//	Analog watchdog interrupt enable.
#define ADC_CSR_CH3		3		//	Channel selection ( bit 3 ).
#define ADC_CSR_CH2		2		//	Channel selection ( bit 2 ).
#define ADC_CSR_CH1		1		//	Channel selection ( bit 1 ).
#define ADC_CSR_CH0		0		//	Channel selection ( bit 0 ).

//	Register name : ADC_CR1.

#define ADC_CR1_SPSEL2		6		//	Prescaler selection ( bit 2 ).
#define ADC_CR1_SPSEL1		5		//	Prescaler selection ( bit 1 ).
#define ADC_CR1_SPSEL0		4		//	Prescaler selection ( bit 0 ).
#define ADC_CR1_CONT		1		//	Continuous conversion.
#define ADC_CR1_ADON		0		//	A/D converter on/off.

//	Register name : ADC_CR2.

#define ADC_CR2_EXTTRIG		6		//	External trigger enable.
#define ADC_CR2_EXTSEL1		5		//	External event selection ( bit 1 ).
#define ADC_CR2_EXTSEL0		4		//	External event selection ( bit 0 ).
#define ADC_CR2_ALIGN		3		//	Data alignment.
#define ADC_CR2_SCAN		1		//	Scan mode enable.

//	Register name : ADC_CR3.

#define ADC_CR3_DBUF		7		//	Data buffer enable.
#define ADC_CR3_OVR		6		//	Overrun flag.

//	Register name : ADC_DRH.

#define ADC_DRH_DH7		7		//	Data bit high ( bit 7 ).
#define ADC_DRH_DH6		6		//	Data bit high ( bit 6 ).
#define ADC_DRH_DH5		5		//	Data bit high ( bit 5 ).
#define ADC_DRH_DH4		4		//	Data bit high ( bit 4 ).
#define ADC_DRH_DH3		3		//	Data bit high ( bit 3 ).
#define ADC_DRH_DH2		2		//	Data bit high ( bit 2 ).	 
#define ADC_DRH_DH1		1		//	Data bit high ( bit 1 ). 
#define ADC_DRH_DH0		0		//	Data bit high ( bit 0 ).

//	Register name : ADC_DRL.

#define ADC_DRL_DL7		7		//	Data bit low ( bit 7 ).
#define ADC_DRL_DL6		6		//	Data bit low ( bit 6 ).
#define ADC_DRL_DL5		5		//	Data bit low ( bit 5 ).
#define ADC_DRL_DL4		4		//	Data bit low ( bit 4 ).
#define ADC_DRL_DL3		3		//	Data bit low ( bit 3 ).
#define ADC_DRL_DL2		2		//	Data bit low ( bit 2 ).	 
#define ADC_DRL_DL1		1		//	Data bit low ( bit 1 ). 
#define ADC_DRL_DL0		0		//	Data bit low ( bit 0 ).
 					
//	Register name : ADC_TDRH.

#define ADC_TDRH_TD15		7		//	Schmit trigger disable ( bit 15 ).
#define ADC_TDRH_TD14		6		//	Schmit trigger disable ( bit 14 ).
#define ADC_TDRH_TD13		5		//	Schmit trigger disable ( bit 13 ).
#define ADC_TDRH_TD12		4		//	Schmit trigger disable ( bit 12 ).
#define ADC_TDRH_TD11		3		//	Schmit trigger disable ( bit 11 ).
#define ADC_TDRH_TD10		2		//	Schmit trigger disable ( bit 10 ).
#define ADC_TDRH_TD9		1		//	Schmit trigger disable ( bit 9 ).
#define ADC_TDRH_TD8		0		//	Schmit trigger disable ( bit 8 ).

//	Register name : ADC_TDRL.

#define ADC_TDRL_TD7		7		//	Schmit trigger disable ( bit 7 ).
#define ADC_TDRL_TD6		6		//	Schmit trigger disable ( bit 6 ).
#define ADC_TDRL_TD5		5		//	Schmit trigger disable ( bit 5 ).
#define ADC_TDRL_TD4		4		//	Schmit trigger disable ( bit 4 ).
#define ADC_TDRL_TD3		3		//	Schmit trigger disable ( bit 3 ).
#define ADC_TDRL_TD2		2		//	Schmit trigger disable ( bit 2 ).
#define ADC_TDRL_TD1		1		//	Schmit trigger disable ( bit 1 ).
#define ADC_TDRL_TD0		0		//	Schmit trigger disable ( bit 0 ).

//	Register name : ADC_HTRH.

#define ADC_HTRH_HT9		1		//	Schmit trigger disable ( bit 9 ).
#define ADC_HTRH_HT8		0		//	Schmit trigger disable ( bit 8 ).
#define ADC_HTRH_HT7		7		//	Schmit trigger disable ( bit 7 ).
#define ADC_HTRH_HT6		6		//	Schmit trigger disable ( bit 6 ).
#define ADC_HTRH_HT5		5		//	Schmit trigger disable ( bit 5 ).
#define ADC_HTRH_HT4		4		//	Schmit trigger disable ( bit 4 ).
#define ADC_HTRH_HT3		3		//	Schmit trigger disable ( bit 3 ).
#define ADC_HTRH_HT2		2		//	Schmit trigger disable ( bit 2 ).

//	Register name : ADC_HTRL.

#define ADC_HTRL_HT1		1		//	Schmit trigger disable ( bit 1 ).
#define ADC_HTRL_HT0		0		//	Schmit trigger disable ( bit 0 ).

//	Register name : ADC_AWSRH.

#define ADC_AWSRH_AWS9		1		//	Analog watchdog status flag 9.
#define ADC_AWSRH_AWS8		0		//	Analog watchdog status flag 8.

//	Register name : ADC_AWSRL.

#define ADC_AWSRL_AWS7		7		//	Analog watchdog status flag 7.
#define ADC_AWSRL_AWS6		6		//	Analog watchdog status flag 6.
#define ADC_AWSRL_AWS5		5		//	Analog watchdog status flag 5.
#define ADC_AWSRL_AWS4		4		//	Analog watchdog status flag 4.
#define ADC_AWSRL_AWS3		3		//	Analog watchdog status flag 3.
#define ADC_AWSRL_AWS2		2		//	Analog watchdog status flag 2.
#define ADC_AWSRL_AWS1		1		//	Analog watchdog status flag 1.
#define ADC_AWSRL_AWS0		0		//	Analog watchdog status flag 0.

//	Register name : ADC_AWCRH.

#define ADC_AWCRH_AWEN9		1		//	Analog watchdog enable bit 9.
#define ADC_AWCRH_AWEN8		0		//	Analog watchdog enable bit 8.

//	Register name : ADC_AWCRL.

#define ADC_AWCRL_AWEN7		7		//	Analog watchdog enable bit 7.
#define ADC_AWCRL_AWEN6		6		//	Analog watchdog enable bit 6.
#define ADC_AWCRL_AWEN5		5		//	Analog watchdog enable bit 5.
#define ADC_AWCRL_AWEN4		4		//	Analog watchdog enable bit 4.
#define ADC_AWCRL_AWEN3		3		//	Analog watchdog enable bit 3.
#define ADC_AWCRL_AWEN2		2		//	Analog watchdog enable bit 2.
#define ADC_AWCRL_AWEN1		1		//	Analog watchdog enable bit 1.
#define ADC_AWCRL_AWEN0		0		//	Analog watchdog enable bit 0.

#endif

